Repository: xfce-mirror/xfce4-cpugraph-plugin
Catalog: po/*.po
Languages: ug

source: Graphical representation of the CPU load
ug: ‫CPU يۈكىنى گىرافىك شەكلىدە قىلىپ كۆرسىتىدۇ

source: CPU usage: %.1f%%
ug: CPU ئىشلىتىلىشى: %.1f%%

source: 'Overall' is showing the impact on the overall performance of the machine.
ug: «ئومۇمىي» ماشىنىنىڭ ئومۇمىي ئىقتىدارىغا بولغان تەسىرىنى بىلدۈرىدۇ.

source: 'Hotspots' is showing the momentary performance impact on just the threads involved in suboptimal SMT scheduling decisions.
ug: «قىزىق نۇقتا» پەقەت ئىككىنچى ئورۇندىكى SMT كۈنتەرتىپ قارارىدىكى جەريانچاق شۇئان ئىقتىدارىنىڭ تەسىرىنى كۆرسىتىدۇ.

source: CPU Graph Properties
ug: CPU گىرافىك خاسلىقى

source: _Close
ug: ياپ(_C)

source: Run in terminal
ug: تېرمىنالدا ئىجرا قىل

source: Use startup notification
ug: قوزغالغاندا ئۇقتۇرۇش قىل

source: Color used to highlight potentially suboptimal placement of threads on CPUs with SMT
ug: SMT نىڭ CPU دىكى جەريانچاقنىڭ ئىككىنچى ئورۇندىكى رەڭگىنى يورۇتۇپ كۆرسىتىشكە ئىشلىتىدىغان رەڭ

source: Display SMT statistics
ug: SMT ئىستاتىستىكىسىنى كۆرسىتىدۇ

source: Highlight suboptimal SMT scheduling
ug: ئىككىنچى SMT كۈنتەرتىپىنى يورۇتىدۇ

source: SMT issues color:
ug: SMT مەسىلە رەڭگى:

source: Use non-linear time-scale
ug: سىزىقسىز ۋاقىت ئۆلچىكى ئىشلەت

source: Per-core history graphs
ug: ھەر بىر يادرونىڭ تارىخى گىرافىكى

source: Color 1:
ug: 1-رەڭ‎‏:

source: Color 2:
ug: 2-رەڭ‎‏:

source: Color 3:
ug: 3-رەڭ‎‏:

source: System:
ug: سىستېما:

source: User:
ug: ئىشلەتكۈچى:

source: Nice:
ug: ياخشى:

source: IO wait:
ug: كىرگۈزۈش چىقىرىش كۈتۈش ۋاقتى:

source: Background:
ug: تەگلىك:

source: Show current usage bar
ug: نۆۋەتتىكى ئىشلىتىلىش بالدىقىنى كۆرسىتىدۇ

source: Bars color:
ug: بالداق رەڭگى:

source: Show frame
ug: كاندۇك كۆرسەت

source: Show border
ug: گىرۋەكنى كۆرسەت

source: Appearance
ug: كۆرۈنۈشى

source: Advanced
ug: ئالىي

source: Stats
ug: ئىستاتىستىكا

source: Fastest (~250ms)
ug: ئەڭ تېز (~250ms)

source: Fast (~500ms)
ug: تېز (~500ms)

source: Normal (~750ms)
ug: ئادەتتىكى (~750ms)

source: Slow (~1s)
ug: ئاستا (~1s)

source: Slowest (~3s)
ug: ئەڭ ئاستا (~3s)

source: Update Interval:
ug: يېڭىلاش ۋاقتى:

source: All
ug: ھەممىسى

source: Tracked Core:
ug: كۆزىتىلىدىغان يادرو:

source: Width:
ug: كەڭلىك:

source: Height:
ug: ئېگىزلىك:

source: Threshold (%):
ug: بوسۇغا قىممىتى(%):

source: Spacing:
ug: ئارىلىق:

source: Spacing between per-core history graphs
ug: ھەر بىر يادرونىڭ تارىخى گىرافىكىنىڭ ئارىسىدىكى ئارىلىق

source: Associated command:
ug: مۇناسىۋەتلىك بۇيرۇق:

source: The command to run when the plugin is left-clicked.
ug: قىستۇرما سول چېكىلگەندە ئىجرا قىلىنىدىغان بۇيرۇق.

source: If not specified, it defaults to xfce4-taskmanager, htop or top.
ug: ئەگەر بەلگىلەنمىگەن بولسا، كۆڭۈلدىكى xfce4-taskmanager، htop ياكى top بولىدۇ.

source: Disabled
ug: چەكلەنگەن

source: Normal
ug: نورمال

source: No history
ug: تارىخ خاتىرىسى يوق

source: Grid
ug: سېتكا

source: Mode:
ug: ئۇسۇلى:

source: Solid
ug: ﻣﯘﻗﯩﻢ

source: Gradient
ug: كۆركەم

source: Fire
ug: ئۇچقۇن

source: Detailed
ug: تەپسىلاتى

source: Color mode:
ug: رەڭگى:

source: SMT detected: Yes
ug: SMT بايقالدى: ھەئە

source: SMT detected: No
ug: SMT بايقالدى: ياق

source: Number of SMT scheduling incidents: %u
ug: SMT كۈنتەرتىپتىكى ھادىسە سانى: %u

source: Estimated performance impact:
ug: مۆلچەردىكى ئۈنۈم تەسىرى:

source: Overall: %.3g%%
ug: ئومۇمىي: %.3g%%

source: Hotspots: %.3g%%
ug: قىزىق نۇقتا: %.3g%%

source: SMT detected: N/A
ug: SMT بايقالدى: ماس كەلمەيدۇ

source: CPU Graph
ug: ‫CPU گىرافىكى
